app/services/contest/race_service.rb

  def race
    pet_1 = @contest.contestant_1_json
    pet_2 = @contest.contestant_2_json

    pet_1_score = race_score(pet_1, pet_2)
    pet_2_score = race_score(pet_2, pet_1)

    sleep 3

    # Ensures pet_2 is the arbitrary winner in the case of a tie.
    contest_winner_id = pet_1_score >= pet_2_score ? pet_1["id"] : pet_2["id"]
    @contest.update(status: "complete", winner_id: contest_winner_id)
---
UPDATE "contests" SET "status" = ?, "winner_id" = ?, "updated_at" = ? WHERE "contests"."id" = ?  [["status", "complete"], ["winner_id", "8d812098-0831-478e-b124-67f336284d88"], ["updated_at", "2022-05-09 05:39:58.247643"], ["id", 14]]