app/controllers/contests_controller.rb

SELECT "contests".* FROM "contests"
---
  def index
    @contests = Contest.all.to_json

INSERT INTO "contests" ("first_contestant_id", "second_contestant_id", "status", "contest_type", "winner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @contest = Contest.create(first_contestant_id: contest_params[:first_contestant_id], second_contestant_id: contest_params[:second_contestant_id], contest_type: contest_params[:type], status: "started")

SELECT "contests".* FROM "contests" WHERE "contests"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
---
  def set_contest
    @contest = Contest.find(params[:id])